{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello",
        "Hi",
        "Hey",
        "Salutation",
        "Greetings",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "Skillful morning",
        "Beneficial morning",
        "Good day",
        "Good to see you",
        "How are you",
        "How's it going",
        "How do you do",
        "How's everything",
        "How's life",
        "How's your day",
        "How's your day going"
      ],
      "responses": [
        "Hello! How can I help you today?",
        "Hi there! What can I do for you?",
        "Hey! What brings you here today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye",
        "Bye",
        "See you later",
        "Adios",
        "Take care",
        "See you subsequently",
        "Farewell",
        "Catch you later",
        "Until next time",
        "So long",
        "Later",
        "Ciao",
        "Peace out",
        "Have a good one",
        "See you soon"
      ],
      "responses": [
        "Goodbye! If you have any more questions, feel free to ask.",
        "Bye! Have a great day!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "Thanks a lot",
        "Appreciate it",
        "Thank you so much",
        "Thanks a mint",
        "Thanks a pile",
        "Thank you and then much",
        "Thanks a bunch",
        "Thanks a ton",
        "Thanks a million",
        "Thanks for your help",
        "Thanks for your assistance",
        "Thanks for your support",
        "Thanks for your guidance",
        "Thanks for your time",
        "Thanks for your advice",
        "Thanks for your output",
        "Thanks for your feedback",
        "Thanks for your response"
      ],
      "responses": [
        "You're welcome! If you need assistance, feel free to ask.",
        "No problem! Let me know if there's anything else I can help with."
      ]
    },
    {
      "tag": "penalty_policy",
      "patterns": [
        "How are overdue, lost, or damaged books handled?",
        "What is the procedure for overdue, lost, or damaged books?",
        "What happens if a book is overdue, lost, or damaged?",
        "How do you deal with books that are late, lost, or damaged?",
        "What are the policies for overdue, lost, or damaged library materials?",
        "What are the penalties for overdue, lost, or damaged books?",
        "What are the consequences if I return a book late, lose it, or damage it?",
        "Are there fines or fees for overdue, lost, or damaged books?",
        "What's the library's process when a book isn't returned on time, is lost, or gets damaged?",
        "What if my library book is late, lost, or I damage it?",
        "Late, lost, or damaged books - what's the deal?",
        "Could you explain how situations involving late returns, lost items, or book damage are resolved?",
        "What steps are taken if a library book is overdue, goes missing, or is returned in poor condition?",
        "What is the library's policy on overdue, lost, or damaged books?",
        "What are the library's rules for overdue, lost, or damaged books?",
        "What are the library's policies regarding overdue, lost, or damaged books?",
        "What are the library's guidelines for overdue, lost, or damaged books?",
        "What are the library's procedures for overdue, lost, or damaged books?"
      ],
      "responses": [
        "If books are returned past their due date, a fine will be incurred. If books are damaged, a fine will also be assessed based on the condition. In the event a book is lost, you will be required to pay its value or provide a new replacement copy. It's important to return books on time and in good condition.",
        "There's a fine for overdue books. You'll also be fined for damaging books, with the amount depending on the condition. If a book is lost, you're expected to pay its value or get a new one for the library. It's important to return books on time and in good condition."
      ]
    },
    {
      "tag": "loan_period",
      "patterns": [
        "What is the maximum borrowing period for books?",
        "How long can I borrow books for at most?",
        "What's the longest I can keep a library book?",
        "Is there a maximum loan period for books?",
        "What is the maximum checkout duration for books?",
        "How long is the maximum loan term for library books?",
        "For how long can books be borrowed at maximum?",
        "What's the library's policy on the maximum borrowing time for books?",
        "Could you tell me the maximum time limit for borrowing books?",
        "What is the upper limit for how long I can borrow books?",
        "How long do I get to keep books I borrow?",
        "Max borrow time for books?",
        "Longest book loan period?",
        "What's the furthest out a due date can be for a book?",
        "How long can I have a book before I need to return it?",
        "What is the maximum time I can borrow a book?",
        "How long can I borrow a book for?",
        "What is the maximum duration for borrowing books?",
        "How long can I keep a book before returning it?",
        "What is the maximum time allowed for borrowing books?",
        "How long can I borrow a book from the library?"
      ],
      "responses": [
        "The maximum borrowing period for textbooks is 3 months, while for other materials it is 1 month. You can renew a book for up to 10 days if it is not overdue.",
        "For textbooks, the maximum loan duration is 3 months, and for other documents, it's 1 month. You can renew a book for up to 10 days if it is not overdue."
      ]
    },
    {
      "tag": "max_quantity_borrowed_books",
      "patterns": [
        "What is the maximum number of books I can borrow?",
        "How many books can I borrow at most?",
        "What's the limit on the number of books I can check out?",
        "Is there a maximum quantity of books I can borrow?",
        "How many books am I allowed to borrow at once?",
        "What is the upper limit for borrowing books?",
        "Can you tell me the maximum number of books I can take out?",
        "How many books can I have checked out at one time?",
        "What's the library's policy on the maximum number of borrowed books?",
        "Could you inform me about the maximum quantity of books I can borrow?",
        "What is the maximum number of books I can borrow from the library?",
        "How many books can I borrow at a time?",
        "What's the maximum number of books I can borrow?",
        "How many books can I borrow in total?",
        "Is there a limit on the number of books I can borrow?",
        "What is the maximum number of books I can borrow at once?",
        "How many books can I borrow from the library?",
        "What is the maximum number of books I can borrow at a time?",
        "How many books can I borrow from the library at once?",
        "What is the maximum number of books I can borrow at the library?",
        "How many books can I borrow from the library at most?",
        "What is the maximum quantity of books I can borrow?"
      ],
      "responses": [
        "The maximum quantity of textbooks is 7, while for other materials it is 5.",
        "For textbooks, the maximum quantity is 7, and for other documents, it's 5."
      ]
    },
    {
      "tag": "document_search",
      "patterns": [
        "How to search for documents in the library?",
        "How can I find documents in the library?",
        "What's the process to search for documents?",
        "Can you guide me on searching documents?",
        "How do I look up documents in the library?",
        "How to search for resources in the library?",
        "How can I find resources in the library?",
        "What's the process to search for resources?",
        "Can you guide me on searching resources?",
        "How do I look up resources in the library?",
        "How to search for books in the library?",
        "How can I find books in the library?",
        "What's the process to search for books?",
        "Can you guide me on searching books?",
        "How do I look up books in the library?",
        "How to search for materials in the library?",
        "How can I find materials in the library?",
        "What's the process to search for materials?",
        "Can you guide me on searching materials?",
        "How do I look up materials in the library?"
      ],
      "responses": [
        "Visit the library's homepage: http://lib.dut.udn.vn/ or contact the receptionist directly for more information."
      ]
    },
    {
      "tag": "Q&A",
      "patterns": [
        "What are the ways to contact if you have any problems or questions?",
        "How to contact if you have any problems or questions?",
        "What should I do if I have a problem or question?",
        "Who can I reach out to for help?",
        "Is there a contact person for inquiries?",
        "Where to go for help with problems or questions?",
        "Where to find help with problems or questions?",
        "How to get help with problems or questions?",
        "How to reach out for help with problems or questions?",
        "How to get in touch for help with problems or questions?",
        "How can I get assistance if I have a problem or question?",
        "Who should I contact if I have a problem or question?",
        "Who can I contact if I have a problem or question?",
        "Is there a phone number or email I can use for inquiries?",
        "How can I reach out if I have an issue?",
        "Where can I find contact information for support?",
        "How do I get in touch with someone about a problem?",
        "Tell me how to contact customer service.",
        "What's the best way to get help quickly?",
        "What are the contact options for questions?"
      ],
      "responses": [
        "If you have any problems or questions, you can contact the library staff at the circulation desk or reach out via email at is@dut.udn.vn. You can also message directly via fanpage https://www.facebook.com/DUT.LibraryPage or call directly via phone number."
      ]
    },
    {
      "tag": "book_search",
      "patterns": [
        "Can you recommend a book?",
        "I'm looking for a book",
        "Recommend me something to read",
        "Posterior you recommend a book?",
        "Can you advocate a book?",
        "Suggest a book",
        "What book do you suggest?",
        "What book would you recommend?",
        "Can you give me a book recommendation?",
        "Can you suggest a book for me?",
        "What book should I read?",
        "Do you have any book recommendations?",
        "Can you help me find a book to read?",
        "What book do you think I would like?",
        "Can you suggest a book based on my interests?",
        "I’m looking for book suggestions, can you help?",
        "Could you advise me on a book to read?",
        "What’s a good book to read right now?",
        "Do you have any favorite books to recommend?",
        "Could you advise me on a book to read?",
        "Can you point me to some interesting books?"
      ],
      "responses": [
        "Certainly! What genre are you interested in?",
        "Sure, I'd be happy to recommend a book. What type of book are you in the mood for?",
        "I can help with that! Do you have a specific genre in mind, like 'Science Fiction' or 'History'?"
      ]
    },
    {
      "tag": "specific_book_search",
      "patterns": [
        "I want to read Education books",
        "I'm looking for Education books",
        "Can you recommend me a Concise Encyclopedia of Psychology book?",
        "Can you suggest me a Concise Encyclopedia of Psychology book?",
        "Can you help me find Concise Encyclopedia of Psychology books?",
        "Can you recommend some editions of the Concise Encyclopedia of Psychology?",
        "What’s the best Concise Encyclopedia of Psychology book you can recommend?",
        "Do you have a recommended Concise Encyclopedia of Psychology in the library?",
        "Do you have The Enjoyment of Music?",
        "Find me The Enjoyment of Music",
        "Is there any book called Themes in Reading?",
        "Show me books named Themes in Reading",
        "Can I borrow Themes in Reading?",
        "Could you suggest a Understanding Second Language Acquisition book?",
        "Do you have any recommendations for a Understanding Second Language Acquisition?",
        "Can you help me find a Understanding Second Language Acquisition book?",
        "I’m looking for a Understanding Second Language Acquisition, can you recommend one?",
        "Are there any good Understanding Second Language Acquisition books you can suggest?",
        "I’m interested in the Ielts. Can you recommend a good edition?",
        "What’s the best source for Ielts books?",
        "I like the Ielts books. Any suggestions?",
        "Can you suggest a Ielts book for my research?"
      ],
      "responses": ["Please wait while I search for that book."]
    },
    {
      "tag": "Computer science, Information & General works",
      "patterns": [
        "Computer Science",
        "Computer science, Information & General works",
        "Recommend a Computer science, Information & General works book",
        "Recommend a book in Computer science, Information & General works",
        "Computer science, Information & General works genre",
        "Computer science, Information & General works books",
        "I'm looking for a book in Computer science, Information & General works",
        "Can you recommend me a Computer science, Information & General works book?",
        "Can you suggest me a Computer science, Information & General works book?",
        "I want to read Computer science, Information & General works books",
        "I like Computer science, Information & General works books. Can you recommend me?",
        "Can you help me find a book on the subject of Computer science, Information & General works?",
        "Tell me about books on Computer science, Information & General works",
        "I'm interested in Computer science, Information & General works books",
        "Could you recommend some popular books in Computer Science and Information?",
        "Are there any comprehensive guides on Computer Science and Information?",
        "What are some essential reads in Computer Science and Information & General Works?",
        "I want to explore books on Information Technology and Computer Science fields.",
        "Please suggest advanced books on Computer Science and Information & General Works.",
        "I need some references for my research in Computer Science and Information.",
        "I’m searching for resources related to Computer Science and Information studies."
      ]
    },
    {
      "tag": "Philosophy &  Psychology",
      "patterns": [
        "Philosophy",
        "Psychology",
        "Philosophy &  Psychology",
        "Recommend a Philosophy &  Psychology book",
        "Recommend a book in Philosophy &  Psychology",
        "Philosophy &  Psychology genre",
        "Philosophy &  Psychology books",
        "I'm looking for a book in Philosophy &  Psychology",
        "Can you recommend me a Philosophy &  Psychology book?",
        "Can you suggest me a Philosophy &  Psychology book?",
        "I want to read Philosophy &  Psychology books",
        "I like Philosophy &  Psychology books. Can you recommend me?",
        "Can you help me find a book on the subject of Philosophy &  Psychology?",
        "Tell me about books on Philosophy &  Psychology",
        "I'm interested in Philosophy &  Psychology books",
        "Could you recommend some popular books in Philosophy and Psychology?",
        "Are there any comprehensive guides on Philosophy and Psychology?",
        "What are some essential reads in Philosophy and Psychology?",
        "I want to explore books on Philosophy and Psychology fields.",
        "Please suggest advanced books on Philosophy and Psychology."
      ]
    },
    {
      "tag": "Religion",
      "patterns": [
        "Religion",
        "Recommend a Religion book",
        "Recommend a book in Religion",
        "Religion genre",
        "Religion books",
        "I'm looking for a book in Religion",
        "Can you recommend me a Religion book?",
        "Can you suggest me a Religion book?",
        "I want to read Religion books",
        "I like Religion books. Can you recommend me?",
        "Can you help me find a book on the subject of Religion?",
        "Tell me about books on Religion",
        "I'm interested in Religion books",
        "Could you recommend some popular books in Religion?",
        "Are there any comprehensive guides on Religion?",
        "What are some essential reads in Religion?",
        "I want to explore books on Religion fields.",
        "Please suggest advanced books on Religion.",
        "I need some references for my research in Religion.",
        "I’m searching for resources related to Religion studies."
      ]
    },

    {
      "tag": "Social Science",
      "patterns": [
        "Social books",
        "Social Science",
        "Recommend a Social Science book",
        "Recommend a book in Social Science",
        "Social Science genre",
        "Social Science books",
        "I'm looking for a book in Social Science",
        "Can you recommend me a Social Science book?",
        "Can you suggest me a Social Science book?",
        "I want to read Social Science books",
        "I like Social Science books. Can you recommend me?",
        "Can you help me find a book on the subject of Social Science?",
        "Tell me about books on Social Science",
        "I'm interested in Social Science books",
        "Could you recommend some popular books in Social Science?",
        "Are there any comprehensive guides on Social Science?",
        "What are some essential reads in Social Science?",
        "I want to explore books on Social Science fields.",
        "Please suggest advanced books on Social Science.",
        "I need some references for my research in Social Science.",
        "I’m searching for resources related to Social Science studies."
      ]
    },
    {
      "tag": "Language",
      "patterns": [
        "Language",
        "Recommend a Language book",
        "Recommend a book in Language",
        "Language genre",
        "Language books",
        "I'm looking for a book in Language",
        "Can you recommend me a Language book?",
        "Can you suggest me a Language book?",
        "I want to read Language books",
        "I like Language books. Can you recommend me?",
        "Can you help me find a book on the subject of Language?",
        "Tell me about books on Language",
        "I'm interested in Language books",
        "Could you recommend some popular books in Language?",
        "Are there any comprehensive guides on Language?",
        "What are some essential reads in Language?",
        "I want to explore books on Language fields.",
        "Please suggest advanced books on Language.",
        "I need some references for my research in Language.",
        "I’m searching for resources related to Language studies."
      ]
    },
    {
      "tag": "Science",
      "patterns": [
        "Science",
        "Recommend a Science book",
        "Recommend a book in Science",
        "Science genre",
        "Science books",
        "I'm looking for a book in Science",
        "Can you recommend me a Science book?",
        "Can you suggest me a Science book?",
        "I want to read Science books",
        "I like Science books. Can you recommend me?",
        "Can you help me find a book on the subject of Science?",
        "Tell me about books on Science",
        "I'm interested in Science books",
        "Could you recommend some popular books in Science?",
        "Are there any comprehensive guides on Science?",
        "What are some essential reads in Science?",
        "I want to explore books on Science fields.",
        "Please suggest advanced books on Science.",
        "I need some references for my research in Science.",
        "I’m searching for resources related to Science studies."
      ]
    },
    {
      "tag": "Technology",
      "patterns": [
        "Technology",
        "Recommend a Technology book",
        "Recommend a book in Technology",
        "Technology genre",
        "Technology books",
        "I'm looking for a book in Technology",
        "Can you recommend me a Technology book?",
        "Can you suggest me a Technology book?",
        "I want to read Technology books",
        "I like Technology books. Can you recommend me?",
        "Can you help me find a book on the subject of Technology?",
        "Tell me about books on Technology",
        "I'm interested in Technology books",
        "Could you recommend some popular books in Technology?",
        "Are there any comprehensive guides on Technology?",
        "What are some essential reads in Technology?",
        "I want to explore books on Technology fields.",
        "Please suggest advanced books on Technology.",
        "I need some references for my research in Technology.",
        "I’m searching for resources related to Technology studies."
      ]
    },
    {
      "tag": "Arts & Entertainment",
      "patterns": [
        "Art",
        "Entertainment",
        "Arts & Entertainment",
        "Recommend a Arts & Entertainment book",
        "Recommend a book in Arts & Entertainment",
        "Arts & Entertainment genre",
        "Arts & Entertainment books",
        "I'm looking for a book in Arts & Entertainment",
        "Can you recommend me a Arts & Entertainment book?",
        "Can you suggest me a Arts & Entertainment book?",
        "I want to read Arts & Entertainment books",
        "I like Arts & Entertainment books. Can you recommend me?",
        "Can you help me find a book on the subject of Arts & Entertainment?",
        "Tell me about books on Arts & Entertainment",
        "I'm interested in Arts & Entertainment books",
        "Could you recommend some popular books in Arts & Entertainment?",
        "Are there any comprehensive guides on Arts & Entertainment?",
        "What are some essential reads in Arts & Entertainment?",
        "I want to explore books on Arts & Entertainment fields.",
        "Please suggest advanced books on Arts & Entertainment.",
        "I need some references for my research in Arts & Entertainment.",
        "I’m searching for resources related to Arts & Entertainment studies."
      ]
    },
    {
      "tag": "Literature",
      "patterns": [
        "Literature",
        "Recommend a Literature book",
        "Recommend a book in Literature",
        "Literature genre",
        "Literature books",
        "I'm looking for a book in Literature",
        "Can you recommend me a Literature book?",
        "Can you suggest me a Literature book?",
        "I want to read Literature books",
        "I like Literature books. Can you recommend me?",
        "Can you help me find a book on the subject of Literature?",
        "Tell me about books on Literature",
        "I'm interested in Literature books",
        "Could you recommend some popular books in Literature?",
        "Are there any comprehensive guides on Literature?",
        "What are some essential reads in Literature?",
        "I want to explore books on Literature fields.",
        "Please suggest advanced books on Literature.",
        "I need some references for my research in Literature.",
        "I’m searching for resources related to Literature studies."
      ]
    },
    {
      "tag": "History & Geography",
      "patterns": [
        "History",
        "Geography",
        "History & Geography",
        "Recommend a History & Geography book",
        "Recommend a book in History & Geography",
        "History & Geography genre",
        "History & Geography books",
        "I'm looking for a book in History & Geography",
        "Can you recommend me a History & Geography book?",
        "Can you suggest me a History & Geography book?",
        "I want to read History & Geography books",
        "I like History & Geography books. Can you recommend me?",
        "Can you help me find a book on the subject of History & Geography?",
        "Tell me about books on History & Geography",
        "I'm interested in History & Geography books",
        "Could you recommend some popular books in History and Geography?",
        "What are some essential reads in History and Geography?",
        "I want to explore books on History and Geography fields.",
        "Please suggest advanced books on History and Geography.",
        "I need some references for my research in History and Geography.",
        "I’m searching for resources related to History and Geography studies."
      ]
    }
  ]
}
